In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\nurzahidah\anaconda3\lib\site-packages (0.4.1)
Requirement already satisfied: ipython>=1.0 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython-sql) (1.4.32)
Requirement already satisfied: sqlparse in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: prettytable<1 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: pickleshare in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (61.2.0)
Requirement already satisfied: stack-data in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: jedi>=0.16 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pygments>=2.4.0 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: traitlets>=5 in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: colorama in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: decorator in c:\users\nurzahidah\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\nurzahidah\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\nurzahidah\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\nurzahidah\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: asttokens in c:\users\nurzahidah\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\nurzahidah\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Requirement already satisfied: executing in c:\users\nurzahidah\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)
Note: you may need to restart the kernel to use updated packages.

In [3]:
df = pd.read_csv("US_Accidents_Dec21_updated.csv")
df.head(5)

,ID,Severity,Start_Time,End_Time,Start_Lat,Start_Lng,End_Lat,End_Lng,Distance(mi),Description,...,Roundabout,Station,Stop,Traffic_Calming,Traffic_Signal,Turning_Loop,Sunrise_Sunset,Civil_Twilight,Nautical_Twilight,Astronomical_Twilight
0,A-1,3,2016-02-08 00:37:08,2016-02-08 06:37:08,40.108910,-83.092860,40.112060,-83.031870,3.230,Between Sawmill Rd/Exit 20 and OH-315/Olentang...,...,False,False,False,False,False,False,Night,Night,Night,Night
1,A-2,2,2016-02-08 05:56:20,2016-02-08 11:56:20,39.865420,-84.062800,39.865010,-84.048730,0.747,At OH-4/OH-235/Exit 41 - Accident.,...,False,False,False,False,False,False,Night,Night,Night,Night
2,A-3,2,2016-02-08 06:15:39,2016-02-08 12:15:39,39.102660,-84.524680,39.102090,-84.523960,0.055,At I-71/US-50/Exit 1 - Accident.,...,False,False,False,False,False,False,Night,Night,Night,Day
3,A-4,2,2016-02-08 06:51:45,2016-02-08 12:51:45,41.062130,-81.537840,41.062170,-81.535470,0.123,At Dart Ave/Exit 21 - Accident.,...,False,False,False,False,False,False,Night,Night,Day,Day
4,A-5,3,2016-02-08 07:53:43,2016-02-08 13:53:43,39.172393,-84.492792,39.170476,-84.501798,0.500,At Mitchell Ave/Exit 6 - Accident.,...,False,False,False,False,False,False,Day,Day,Day,Day

In [4]:
df_holiday = pd.read_csv("US Holiday Dates (2004-2021).csv")
df_holiday.head(5)

         Date      Holiday    WeekDay  Month  Day  Year
0  2004-07-04  4th of July     Sunday      7    4  2004
1  2005-07-04  4th of July     Monday      7    4  2005
2  2006-07-04  4th of July    Tuesday      7    4  2006
3  2007-07-04  4th of July  Wednesday      7    4  2007
4  2008-07-04  4th of July     Friday      7    4  2008

In [5]:
# if already connected, comment this line
cnn = sql.connect('accident.db')
cnn1 = sql.connect('holiday.db')

In [6]:
# populate dataframe to database, if already populated comment out this line
df.to_sql('accident',cnn)

2845342

In [7]:
# populate dataframe to database, if already populated comment out this line
df_holiday.to_sql('holiday',cnn1)

342

In [8]:
%load_ext sql

In [9]:
%sql sqlite://

In [10]:
%sql sqlite:///accident.db
%sql ATTACH DATABASE 'holiday.db' as 'holiday';

   sqlite://
 * sqlite:///accident.db
Done.

[]

In [12]:
%sql ATTACH DATABASE 'holiday.db' as 'holiday';

   sqlite://
 * sqlite:///accident.db
(sqlite3.OperationalError) database holiday is already in use
[SQL: ATTACH DATABASE 'holiday.db' as 'holiday' ;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [63]:
%sql SELECT * FROM accident limit 5

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 'A-1', 3, '2016-02-08 00:37:08', '2016-02-08 06:37:08', 40.10891, -83.09286, 40.11206, -83.03187, 3.23, 'Between Sawmill Rd/Exit 20 and OH-315/Olentangy Riv Rd/Exit 22 - Accident.', None, 'Outerbelt E', 'R', 'Dublin', 'Franklin', 'OH', '43017', 'US', 'US/Eastern', 'KOSU', '2016-02-08 00:53:00', 42.1, 36.1, 58.0, 29.76, 10.0, 'SW', 10.4, 0.0, 'Light Rain', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Night', 'Night', 'Night', 'Night', '2016-02-08', 2, 2016, 0, 8),
 (1, 'A-2', 2, '2016-02-08 05:56:20', '2016-02-08 11:56:20', 39.86542, -84.0628, 39.86501, -84.04873, 0.747, 'At OH-4/OH-235/Exit 41 - Accident.', None, 'I-70 E', 'R', 'Dayton', 'Montgomery', 'OH', '45424', 'US', 'US/Eastern', 'KFFO', '2016-02-08 05:58:00', 36.9, None, 91.0, 29.68, 10.0, 'Calm', None, 0.02, 'Light Rain', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Night', 'Night', 'Night', 'Night', '2016-02-08', 2, 2016, 5, 8),
 (2, 'A-3', 2, '2016-02-08 06:15:39', '2016-02-08 12:15:39', 39.10266, -84.52468, 39.10209, -84.52396, 0.055, 'At I-71/US-50/Exit 1 - Accident.', None, 'I-75 S', 'R', 'Cincinnati', 'Hamilton', 'OH', '45203', 'US', 'US/Eastern', 'KLUK', '2016-02-08 05:53:00', 36.0, None, 97.0, 29.7, 10.0, 'Calm', None, 0.02, 'Overcast', 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 'Night', 'Night', 'Night', 'Day', '2016-02-08', 2, 2016, 6, 8),
 (3, 'A-4', 2, '2016-02-08 06:51:45', '2016-02-08 12:51:45', 41.06213, -81.53784, 41.06217, -81.53546999999998, 0.123, 'At Dart Ave/Exit 21 - Accident.', None, 'I-77 N', 'R', 'Akron', 'Summit', 'OH', '44311', 'US', 'US/Eastern', 'KAKR', '2016-02-08 06:54:00', 39.0, None, 55.0, 29.65, 10.0, 'Calm', None, None, 'Overcast', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Night', 'Night', 'Day', 'Day', '2016-02-08', 2, 2016, 6, 8),
 (4, 'A-5', 3, '2016-02-08 07:53:43', '2016-02-08 13:53:43', 39.172393, -84.49279200000002, 39.170476, -84.501798, 0.5, 'At Mitchell Ave/Exit 6 - Accident.', None, 'I-75 S', 'R', 'Cincinnati', 'Hamilton', 'OH', '45217', 'US', 'US/Eastern', 'KLUK', '2016-02-08 07:53:00', 37.0, 29.8, 93.0, 29.69, 10.0, 'WSW', 10.4, 0.01, 'Light Rain', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'Day', 'Day', 'Day', 'Day', '2016-02-08', 2, 2016, 7, 8)]

In [14]:
%%sql
alter table accident add Date date;

   sqlite://
 * sqlite:///accident.db
Done.

[]

In [15]:
%%sql
alter table accident add Accident_month int;

   sqlite://
 * sqlite:///accident.db
Done.

[]

In [16]:
%%sql
UPDATE accident 
SET Accident_month = SUBSTRING(Start_Time, 6, 2) ;

   sqlite://
 * sqlite:///accident.db
2845342 rows affected.

[]

In [18]:
%%sql
alter table accident add Accident_year int;

   sqlite://
 * sqlite:///accident.db
(sqlite3.OperationalError) duplicate column name: Accident_year
[SQL: alter table accident add Accident_year int;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [19]:
%%sql
UPDATE accident 
SET Accident_year = SUBSTRING(Start_Time, 0, 5) ;

   sqlite://
 * sqlite:///accident.db
2845342 rows affected.

[]

In [20]:
%%sql
UPDATE accident 
SET Date = SUBSTRING(Start_Time, 1, 10) ;

   sqlite://
 * sqlite:///accident.db
2845342 rows affected.

[]

In [21]:
%%sql
ALTER TABLE accident
ADD Accident_Hour int;

   sqlite://
 * sqlite:///accident.db
Done.

[]

In [22]:
%%sql
UPDATE accident 
SET Accident_Hour =  SUBSTRING(Start_Time,11,3);

   sqlite://
 * sqlite:///accident.db
2845342 rows affected.

[]

In [23]:
%%sql
ALTER TABLE accident
ADD Accident_Day int;

   sqlite://
 * sqlite:///accident.db
Done.

[]

In [62]:
%%sql
UPDATE accident 
SET Accident_Day =  SUBSTRING(Date,9,2);

   sqlite://
 * sqlite:///accident.db
2845342 rows affected.

[]

In [25]:
%%sql

SELECT Accident_month, count(Accident_month) as Total
FROM  accident 
Group by Accident_month
ORDER BY Total DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(12, 473943), (11, 360696), (10, 299131), (9, 241822), (6, 226561)]

In [64]:
%%sql

SELECT Accident_Day, count(Accident_Day) as Total
FROM  accident 
Group by Accident_Day
ORDER BY Total DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(23, 106831), (22, 103229), (18, 98804), (30, 98654), (19, 98386)]

In [27]:
%%sql

SELECT Date, count(Date) as Total
FROM  accident 
Group by Date
ORDER BY Total DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[('2021-12-23', 12904),
 ('2021-12-17', 11505),
 ('2021-12-10', 11014),
 ('2021-12-15', 10603),
 ('2021-12-16', 10362)]

In [28]:
%%sql

SELECT Accident_year, count(Accident_year) as Total
FROM  accident 
Group by Accident_year
ORDER BY Total DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(2021, 1511745),
 (2020, 625864),
 (2019, 258615),
 (2017, 163918),
 (2018, 163176)]

In [29]:
%%sql
SELECT Accident_Hour, count(Accident_Hour) as Total
FROM  accident 
Group by Accident_Hour
ORDER BY Total DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(17, 220358), (16, 218385), (15, 214264), (14, 191480), (18, 168982)]

In [30]:
%%sql
SELECT Accident_Hour, count(Accident_Hour) as Total_Severity1
FROM  accident 
WHERE Severity = 1
Group by Accident_Hour
ORDER BY Total_Severity1 DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(16, 2673), (17, 2640), (15, 2197), (18, 2141), (14, 1769)]

In [31]:
%%sql
SELECT Accident_Hour, count(Accident_Hour) as Total_Severity2
FROM  accident 
WHERE Severity = 2
Group by Accident_Hour
ORDER BY Total_Severity2 DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(17, 196443), (16, 194758), (15, 193223), (14, 174399), (13, 151194)]

In [32]:

%%sql
SELECT Accident_Hour, count(Accident_Hour) as Total_Severity3
FROM  accident 
WHERE Severity = 3
Group by Accident_Hour
ORDER BY Total_Severity3 DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(17, 13926), (16, 13622), (15, 11629), (18, 11566), (14, 8601)]

In [33]:
%%sql
SELECT Accident_Hour, count(Accident_Hour) as Total_Severity4
FROM  accident 
WHERE Severity = 4
Group by Accident_Hour
ORDER BY Total_Severity4 DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(17, 7349), (16, 7332), (15, 7215), (18, 6926), (14, 6711)]

In [34]:
%%sql
SELECT Weather_Condition, count(Weather_Condition) as Total
FROM  accident 
Group by Weather_Condition
ORDER BY Total DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[('Fair', 1107194),
 ('Mostly Cloudy', 363959),
 ('Cloudy', 348767),
 ('Partly Cloudy', 249939),
 ('Clear', 173823)]

In [35]:
%%sql

ALTER TABLE accident
RENAME COLUMN "Visibility(mi)" TO Visibility;

   sqlite://
 * sqlite:///accident.db
Done.

[]

In [36]:
%%sql

SELECT Visibility, count(Visibility) as Total
FROM  accident 
Group by Visibility
ORDER BY Total DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[(10.0, 2230276), (7.0, 79649), (9.0, 68817), (8.0, 55955), (5.0, 53933)]

In [37]:
%%sql

SELECT County, count(County) as Total
FROM  accident 
Group by County
ORDER BY Total DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[('Los Angeles', 234122),
 ('Miami-Dade', 143939),
 ('Orange', 114917),
 ('San Bernardino', 55018),
 ('Dallas', 50050)]

In [38]:
%%sql

SELECT Bump, count(Bump) as Total
FROM  accident 
Group by Bump
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2844321), (1, 1021)]

In [39]:
%%sql

SELECT Amenity, count(Amenity) as Total
FROM  accident 
Group by Amenity
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2817352), (1, 27990)]

In [40]:
%%sql

SELECT Crossing, count(Crossing) as Total
FROM  accident 
Group by Crossing
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2645130), (1, 200212)]

In [41]:
percentage = ((200212)/2845342)*100
print('The percentage accident occurs during when there is crossing is ' + str(percentage) + '%'  )

The percentage accident occurs during when there is crossing is 7.03648278484625%

In [42]:
%%sql

SELECT Give_Way, count(Give_Way) as Total
FROM  accident 
Group by Give_Way
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2838474), (1, 6868)]

In [43]:
%%sql

SELECT Junction, count(Junction) as Total
FROM  accident 
Group by Junction
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2554837), (1, 290505)]

In [44]:
percentage = ((290505)/2845342)*100
print('The percentage accident occurs during when there is junction is ' + str(percentage) + '%'  )

The percentage accident occurs during when there is junction is 10.209844721653846%

In [45]:
%%sql

SELECT No_Exit, count(No_Exit) as Total
FROM  accident 
Group by No_Exit
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2841048), (1, 4294)]

In [46]:
%%sql

SELECT Railway, count(Railway) as Total
FROM  accident 
Group by Railway
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2822711), (1, 22631)]

In [47]:
%%sql

SELECT Roundabout, count(Roundabout) as Total
FROM  accident 
Group by Roundabout
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2845219), (1, 123)]

In [48]:
%%sql

SELECT Station, count(Station) as Total
FROM  accident 
Group by Station
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2777347), (1, 67995)]

In [49]:
percentage = ((67995)/2845342)*100
print('The percentage accident occurs during when there is station is ' + str(percentage) + '%'  )

The percentage accident occurs during when there is station is 2.3896951579107184%

In [50]:
%%sql

SELECT Stop, count(Stop) as Total
FROM  accident 
Group by Stop
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2794942), (1, 50400)]

In [51]:
%%sql

SELECT Traffic_Calming, count(Traffic_Calming) as Total
FROM  accident 
Group by Traffic_Calming
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2843630), (1, 1712)]

In [52]:
%%sql

SELECT Traffic_Signal, count(Traffic_Signal) as Total
FROM  accident 
Group by Traffic_Signal
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2580079), (1, 265263)]

In [53]:
percentage = ((265263)/2845342)*100
print('The percentage accident occurs during when there is traffic signal is ' + str(percentage) + '%'  )

The percentage accident occurs during when there is traffic signal is 9.322710591556305%

In [54]:
%%sql

SELECT Turning_Loop, count(Turning_Loop) as Total
FROM  accident 
Group by Turning_Loop
ORDER BY Total DESC

   sqlite://
 * sqlite:///accident.db
Done.

[(0, 2845342)]

In [55]:
%sql SELECT * FROM holiday limit 10

   sqlite://
 * sqlite:///accident.db
Done.

[(0, '2004-07-04', '4th of July', 'Sunday', 7, 4, 2004),
 (1, '2005-07-04', '4th of July', 'Monday', 7, 4, 2005),
 (2, '2006-07-04', '4th of July', 'Tuesday', 7, 4, 2006),
 (3, '2007-07-04', '4th of July', 'Wednesday', 7, 4, 2007),
 (4, '2008-07-04', '4th of July', 'Friday', 7, 4, 2008),
 (5, '2009-07-04', '4th of July', 'Saturday', 7, 4, 2009),
 (6, '2010-07-04', '4th of July', 'Sunday', 7, 4, 2010),
 (7, '2011-07-04', '4th of July', 'Monday', 7, 4, 2011),
 (8, '2012-07-04', '4th of July', 'Wednesday', 7, 4, 2012),
 (9, '2013-07-04', '4th of July', 'Thursday', 7, 4, 2013)]

Which holiday has highest accident count

In [56]:
%%sql
SELECT Holiday, COUNT(Holiday) as TotalCount
FROM  accident as a
LEFT JOIN holiday as b
ON  a.Date = b.Date
GROUP BY Holiday  
ORDER BY TotalCount DESC
LIMIT 5

   sqlite://
 * sqlite:///accident.db
Done.

[('Christmas Eve', 14516),
 ('Thanksgiving Eve', 14249),
 ('New Yearâ€™s Eve', 13711),
 ('Veterans Day', 13233),
 ('Labor Day Weekend', 9343)]

How many % of accident are during holiday

In [58]:
%%sql
SELECT count(*)
FROM  accident as a
LEFT JOIN holiday as b
ON  a.Date = b.Date
WHERE Holiday IS NULL;

   sqlite://
 * sqlite:///accident.db
Done.

[(2702644,)]

In [59]:
percentage = ((2845342 -2702644)/2845342)*100
print('The percentage accident occurs during holiday is ' + str(percentage) + '%'  )

The percentage accident occurs during holiday is 5.015144049467516%